bdbm_drv_new_version/run/fio/log/old_version/fio_FLUSH_iops/2_fio_b256.txt
fio2: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio2: Laying out IO file(s) (1 file(s) / 1000MiB)

fio2: (groupid=0, jobs=1): err= 0: pid=20094: Tue Mar  7 17:22:32 2017
  write: IOPS=11.6k, BW=45.7MiB/s (47.3MB/s)(1000MiB/22189msec)
    slat (usec): min=3, max=27867, avg=85.99, stdev=375.03
    clat (usec): min=1, max=40560, avg=11003.48, stdev=5786.73
     lat (usec): min=5, max=40565, avg=11089.47, stdev=5824.71
    clat percentiles (usec):
     |  1.00th=[  482],  5.00th=[  498], 10.00th=[  524], 20.00th=[ 4704],
     | 30.00th=[10432], 40.00th=[11968], 50.00th=[13120], 60.00th=[14016],
     | 70.00th=[14400], 80.00th=[15424], 90.00th=[15808], 95.00th=[16768],
     | 99.00th=[20096], 99.50th=[23680], 99.90th=[31104], 99.95th=[33024],
     | 99.99th=[38144]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 500=5.28%
    lat (usec) : 750=13.36%, 1000=0.26%
    lat (msec) : 2=0.14%, 4=0.69%, 10=8.14%, 20=71.13%, 50=0.99%
  cpu          : usr=0.79%, sys=7.32%, ctx=117678, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=45.7MiB/s (47.3MB/s), 45.7MiB/s-45.7MiB/s (47.3MB/s-47.3MB/s), io=1000MiB (1049MB), run=22189-22189msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%