bdbm_drv_new_version/run/fio/log/old_version/fio_FLUSH_iops/3_fio_b1024.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=10223: Tue Mar  7 17:04:25 2017
  write: IOPS=6234, BW=24.4MiB/s (25.6MB/s)(1000MiB/41063msec)
    slat (usec): min=3, max=23350, avg=159.69, stdev=553.24
    clat (usec): min=2, max=41560, avg=20365.45, stdev=5641.68
     lat (usec): min=9, max=41564, avg=20525.15, stdev=5677.16
    clat percentiles (usec):
     |  1.00th=[  494],  5.00th=[ 2992], 10.00th=[14400], 20.00th=[19072],
     | 30.00th=[20864], 40.00th=[21632], 50.00th=[21888], 60.00th=[22400],
     | 70.00th=[23424], 80.00th=[23936], 90.00th=[24192], 95.00th=[24448],
     | 99.00th=[26752], 99.50th=[27520], 99.90th=[31104], 99.95th=[34048],
     | 99.99th=[39680]
    lat (usec) : 4=0.01%, 10=0.01%, 20=0.01%, 500=1.94%, 750=2.80%
    lat (usec) : 1000=0.11%
    lat (msec) : 2=0.03%, 4=0.16%, 10=1.43%, 20=20.21%, 50=73.33%
  cpu          : usr=0.59%, sys=4.12%, ctx=131015, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1000MiB (1049MB), run=41063-41063msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%