bdbm_drv_new_version/run/fio/log/old_version/fio_FLUSH_iops/3_fio_b512.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=17234: Tue Mar  7 17:19:29 2017
  write: IOPS=10.8k, BW=42.9MiB/s (44.5MB/s)(1000MiB/23804msec)
    slat (usec): min=3, max=25320, avg=92.29, stdev=367.55
    clat (usec): min=1, max=34012, avg=11805.14, stdev=4866.81
     lat (usec): min=5, max=34020, avg=11897.43, stdev=4896.96
    clat percentiles (usec):
     |  1.00th=[  482],  5.00th=[  502], 10.00th=[  724], 20.00th=[ 9280],
     | 30.00th=[11328], 40.00th=[12096], 50.00th=[13120], 60.00th=[14144],
     | 70.00th=[14400], 80.00th=[15296], 90.00th=[15680], 95.00th=[16768],
     | 99.00th=[20096], 99.50th=[21632], 99.90th=[27008], 99.95th=[28288],
     | 99.99th=[32128]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=4.58%, 750=5.97%, 1000=0.22%
    lat (msec) : 2=0.06%, 4=0.75%, 10=10.41%, 20=76.92%, 50=1.07%
  cpu          : usr=0.84%, sys=6.91%, ctx=131682, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=42.9MiB/s (44.5MB/s), 42.9MiB/s-42.9MiB/s (44.5MB/s-44.5MB/s), io=1000MiB (1049MB), run=23804-23804msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%