bdbm_drv_new_version/run/fio/log/old_version/fio_FLUSH_iops/4_fsy_b512.txt
fio0: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio0: Laying out IO file(s) (1 file(s) / 1000MiB)

fio0: (groupid=0, jobs=1): err= 0: pid=17197: Tue Mar  7 17:19:38 2017
  write: IOPS=6228, BW=24.4MiB/s (25.6MB/s)(1000MiB/41104msec)
    slat (usec): min=3, max=5049, avg=10.78, stdev=21.74
    clat (usec): min=2, max=509517, avg=20162.23, stdev=6196.64
     lat (usec): min=21, max=509522, avg=20173.01, stdev=6198.87
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   17], 10.00th=[   18], 20.00th=[   18],
     | 30.00th=[   18], 40.00th=[   19], 50.00th=[   19], 60.00th=[   20],
     | 70.00th=[   20], 80.00th=[   22], 90.00th=[   25], 95.00th=[   32],
     | 99.00th=[   39], 99.50th=[   44], 99.90th=[   81], 99.95th=[   92],
     | 99.99th=[  116]
    lat (usec) : 4=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=71.50%, 50=28.12%
    lat (msec) : 100=0.32%, 250=0.02%, 750=0.01%
  cpu          : usr=0.53%, sys=95.27%, ctx=143431, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1000MiB (1049MB), run=41104-41104msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%